{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "b96ee97a-489c-40f8-bb9c-9e6c90e8dde9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The graph_notebook.magics extension is already loaded. To reload it, use:\n",
      "  %reload_ext graph_notebook.magics\n"
     ]
    }
   ],
   "source": [
    "import nest_asyncio\n",
    "import time\n",
    "nest_asyncio.apply()\n",
    "import pandas as pd\n",
    "from gremlin_python import statics\n",
    "from gremlin_python.structure.graph import Graph\n",
    "from gremlin_python.process.graph_traversal import __\n",
    "from gremlin_python.process.strategies import *\n",
    "from gremlin_python.driver.driver_remote_connection import DriverRemoteConnection\n",
    "%load_ext graph_notebook.magics"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "5c8991f6-e9ca-4607-b93c-bfa9e78b48b1",
   "metadata": {},
   "outputs": [],
   "source": [
    "# making a graph instance and connecting to database\n",
    "graph = Graph()\n",
    "remoteConn = DriverRemoteConnection('wss://database-prg-instance-1.cbtcet4rvkih.eu-central-1.neptune.amazonaws.com:8182/gremlin','g')\n",
    "g = graph.traversal().withRemote(remoteConn)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "de7b86f3-b177-47de-a79f-b3345e61e373",
   "metadata": {},
   "outputs": [],
   "source": [
    "root = 'Sim mega hood'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "224049f5-ac22-462a-9fc1-fa651d7b308d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def matching_node_value(root):\n",
    "    x_value = g.V().has('value',root).both().values().toList()\n",
    "    x_label = g.V().has('value',root).both().label().toList()\n",
    "    return x_label, x_value\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "4758635e-1454-43fb-90b4-4d4258d561b3",
   "metadata": {},
   "outputs": [],
   "source": [
    "def all_common_product( node_neighbourbood,x_label):\n",
    "    neighbour_product = []\n",
    "    for i in x_label:\n",
    "        neighbour_product = neighbour_product + node_neighbourbood[i] \n",
    "    neighbour_product = set(neighbour_product)\n",
    "    return neighbour_product\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "cd173615-4746-49e9-9eee-cb9b6e42a741",
   "metadata": {},
   "outputs": [],
   "source": [
    "def neighbour_attr_node_match(neighbour_product, node_neighbourbood, x_label, x_value):\n",
    "    \n",
    "    prod_dict = {}\n",
    "    prod_score = {}\n",
    "    for i in neighbour_product:\n",
    "        attributes = []\n",
    "        for label in x_label:\n",
    "            if i in node_neighbourbood[label]: attributes.append(label)\n",
    "            \n",
    "        prod_dict[i] = attributes\n",
    "        prod_score[i] = len(attributes)\n",
    "    \n",
    "    return prod_dict, prod_score\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "3167400d-c28d-4bd5-8824-4a44528b0026",
   "metadata": {},
   "outputs": [],
   "source": [
    "def pagerank_recommendation(root):\n",
    "    node_neighbourbood = {}\n",
    "    x_label, x_value = matching_node_value(root)\n",
    "    for x,y in zip(x_label, x_value):\n",
    "        product_temp = []\n",
    "        print(x,y)\n",
    "        if(x == 'subcategory'):\n",
    "            product = g.V().hasLabel(x).has('value',y).out('sub_of').path().toList()\n",
    "            for i in product:product_temp.append( g.V().has('~id' , i[1].id).path().by('value').toList()[0][0])\n",
    "            node_neighbourbood[x] = product_temp\n",
    "            print(\"Done \\n\")\n",
    "        \n",
    "        if(x != 'subcategory'):\n",
    "            product = g.V().hasLabel(x).has('value',y).both().path().toList()\n",
    "            for i in product:product_temp.append( g.V().has('~id' , i[1].id).path().by('value').toList()[0][0])\n",
    "            node_neighbourbood[x] = product_temp\n",
    "            print(\"Done \\n\")\n",
    "    \n",
    "        \n",
    "    return x_label, x_value, node_neighbourbood\n",
    "\n",
    "            \n",
    " \n",
    "        \n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "83676240-7ee2-43c0-ad14-1ca468f4cffd",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "67aac5a1-012d-41ba-b979-a91bddb7b82c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "subcategory sweater\n",
      "Done \n",
      "\n",
      "section_name men project\n",
      "Done \n",
      "\n",
      "colour_group_name blue\n",
      "Done \n",
      "\n",
      "colour_group_name dark blue\n",
      "Done \n",
      "\n",
      "index_group_name menswear\n",
      "Done \n",
      "\n",
      "perceived_colour_value_name dark\n",
      "Done \n",
      "\n",
      "graphical_appearance_name stripe\n",
      "Done \n",
      "\n",
      "department_name projects\n",
      "Done \n",
      "\n"
     ]
    }
   ],
   "source": [
    "x_label, x_value, node_neighbourbood =  pagerank_recommendation(root)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "7fad6447-76d7-4b98-8215-53ef2f133c3a",
   "metadata": {},
   "outputs": [],
   "source": [
    "neighbour_product = all_common_product( node_neighbourbood,x_label)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "d80bc94a-ca0f-4834-90cb-e2aaab008c31",
   "metadata": {},
   "outputs": [],
   "source": [
    "prod_dict, prod_score = neighbour_attr_node_match(neighbour_product, node_neighbourbood, x_label, x_value)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "30c0d23e-c17d-4e8c-b86a-f04ae8a0be68",
   "metadata": {},
   "outputs": [],
   "source": [
    "prod_score_sorted = sorted( prod_score.items(), key=lambda kv:\n",
    "                 (kv[1], kv[0]),reverse=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "106d41c8-ef30-4638-bffb-0ca2e04873dc",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('Sim mega hood', 8),\n",
       " ('Novelty Knits', 7),\n",
       " ('Novelty Knit', 7),\n",
       " ('Milano thin stripe shirt', 7),\n",
       " ('Lucky AOP CN', 7),\n",
       " ('John half zip mockneck', 7),\n",
       " ('Family 1 MAN Hood', 7),\n",
       " ('Cloude block stripe', 7),\n",
       " ('Christmas Mini Me sweater', 7),\n",
       " ('Christmas Fun', 7),\n",
       " ('Ambition Slim Tapered CNY', 7),\n",
       " ('WALES', 6),\n",
       " ('V-NECK LS SLIM', 6),\n",
       " ('TOAST LS', 6),\n",
       " ('Rincon LS tee', 6),\n",
       " ('Rick mockneck', 6),\n",
       " ('R-neck James stripe', 6),\n",
       " ('Project Suit', 6),\n",
       " ('Phil scuba tee', 6),\n",
       " ('Pepe rugby', 6),\n",
       " ('Pepe Rugby', 6),\n",
       " ('PAUL  R-NECK', 6),\n",
       " ('PATTY MUSCLE HENLEY', 6),\n",
       " ('OAK STRUCTURE SWEATER', 6),\n",
       " ('Multi chevron', 6),\n",
       " ('Milano floral shirt', 6),\n",
       " ('Middlesbrough', 6),\n",
       " ('Merlin r-neck stripe', 6),\n",
       " ('Malte r-neck', 6),\n",
       " ('Mackay sweater', 6),\n",
       " ('Ludvig stripe crewneck', 6),\n",
       " ('LIAM STRIPE KNIT', 6),\n",
       " ('LARRY FANCY', 6),\n",
       " ('LAMB LAMBSWOOL SWEATER', 6),\n",
       " ('KENT R-NECK', 6),\n",
       " ('KANE', 6),\n",
       " ('Johnny knit', 6),\n",
       " ('Hektor AOP resort', 6),\n",
       " ('GASTON STRIPE', 6),\n",
       " ('FOREST roundneck cashmere', 6),\n",
       " ('Dalton striped crew', 6),\n",
       " ('Dalton stripe crewneck', 6),\n",
       " ('Christmas swimshorts', 6),\n",
       " ('Christmas Zero tanktop', 6),\n",
       " ('Christmas T-shirt', 6),\n",
       " ('Christmas Resort Shirt', 6),\n",
       " ('Christmas Onesie', 6),\n",
       " ('Christmas Miller Slider SH', 6),\n",
       " ('CNY hood', 6),\n",
       " ('Blake', 6),\n",
       " ('BYRON CAMPAIGN', 6),\n",
       " ('BISCUIT', 6),\n",
       " ('Arran r-neck', 6),\n",
       " ('shaggy', 5),\n",
       " ('rey mega grossgrain', 5),\n",
       " ('Zebra sweater TOP PRODUCT', 5),\n",
       " ('ZORROW CLEAN', 5),\n",
       " ('ZORROW', 5),\n",
       " ('ZLANTAN LS', 5),\n",
       " ('Yolo Zip L/S', 5),\n",
       " ('Yate', 5),\n",
       " ('YOGHURT V-NECK MERINO', 5),\n",
       " ('YOGHURT V-NECK', 5),\n",
       " ('Wow Relax Shorts', 5),\n",
       " ('Werner rollerneck cable', 5),\n",
       " ('Weekend Harald', 5),\n",
       " ('Wave shorts', 5),\n",
       " ('Wallis casual crewneck', 5),\n",
       " ('Wales sweater', 5),\n",
       " ('WM CORNWALL CLASSIC CREW', 5),\n",
       " ('WILLY l/s BB', 5),\n",
       " ('WAFFLE CTN BASIC STRIPE', 5),\n",
       " ('WAFFLE CTN BASIC', 5),\n",
       " ('Vivi boatneck', 5),\n",
       " ('VIGGO HENLEY L/S/NEWTON', 5),\n",
       " ('VICTOR SLIM VN T-SHIRT', 5),\n",
       " ('VALENTINE Milk', 5),\n",
       " ('VALENTINE Hood', 5),\n",
       " ('V. 5 WILSON C-NECK', 5),\n",
       " ('V-neck Ford', 5),\n",
       " ('V-neck Argyle', 5),\n",
       " ('V-Neck Milan TVP', 5),\n",
       " ('V-NECK SS BASIC FIT FANCY', 5),\n",
       " ('ULRIC SHAWL SWEATER', 5),\n",
       " ('Turner stretch polo', 5),\n",
       " ('Turner set', 5),\n",
       " ('Tuck cropped sweater', 5),\n",
       " ('Tom print', 5),\n",
       " ('Toby braces', 5),\n",
       " ('Tim Tee', 5),\n",
       " ('Tie Stripe', 5),\n",
       " ('Tie Placement Stripe', 5),\n",
       " ('Tie Bold Stripe', 5),\n",
       " ('Tess', 5),\n",
       " ('Teddy', 5),\n",
       " ('TWISTER TURTLENECK', 5),\n",
       " ('TVP Nils sweater', 5),\n",
       " ('TVP Nils', 5),\n",
       " ('TRUXTON HOOD', 5),\n",
       " ('TP Paddington Sweater', 5),\n",
       " ('TORONTO regular crew', 5),\n",
       " ('TOM SUPER FANCY', 5),\n",
       " ('TOM FANCY UU', 5),\n",
       " ('TOM FANCY', 5),\n",
       " ('TOBIE LS BB 5-p', 5),\n",
       " ('TOBI PRINT PJ SET', 5),\n",
       " ('TEST Chase Structure R-neck', 5),\n",
       " ('TD stripe in stripe', 5),\n",
       " ('TD Jason stripe', 5),\n",
       " ('TD Hugo slim fit Stretch PQ', 5),\n",
       " ('Sullivan crewneck', 5),\n",
       " ('Stripe Tee', 5),\n",
       " ('Simon Retro Stripe Tee', 5),\n",
       " ('Sienna', 5),\n",
       " ('Sia', 5),\n",
       " ('Shawlcollar sweater', 5),\n",
       " ('Sergio Stripe Scarf', 5),\n",
       " ('Sergio SS shirt', 5),\n",
       " ('Sela jumper', 5),\n",
       " ('Sean sweater CC', 5),\n",
       " ('Sean sweater', 5),\n",
       " ('Sean crewneck', 5),\n",
       " ('Sandro Bandcollar Detailed(1)', 5),\n",
       " ('Sam ls bd  casual', 5),\n",
       " ('Salomon wool cap', 5),\n",
       " ('Sagus Hood', 5),\n",
       " ('SULLIVAN CREWNECK', 5),\n",
       " ('SUGERCANE HOOD', 5),\n",
       " ('SUGARPUFF PRINT MUSCLE TEE', 5),\n",
       " ('SUGARPUFF MUSCLE TEE', 5),\n",
       " ('STAR v-neck merino', 5),\n",
       " ('STAR v-neck cotton/cash', 5),\n",
       " ('STAR v-neck', 5),\n",
       " ('STAR cashmere v-neck', 5),\n",
       " ('SS RESORT', 5),\n",
       " ('SS Polo marco J', 5),\n",
       " ('SNOW Mockneck cashmere', 5),\n",
       " ('SIGNE BOAT NECK', 5),\n",
       " ('SIBLINGS L/S TEE', 5),\n",
       " ('SEPIA knitted henley', 5),\n",
       " ('SEMLA HOOD', 5),\n",
       " ('SEBASTIAN REGULAR ROLLNECK', 5),\n",
       " ('SAVANNAH sweater', 5),\n",
       " ('SAILOR FRONT PRINT', 5),\n",
       " ('SAFFRON crewneck (1)', 5),\n",
       " ('Russel r-neck', 5),\n",
       " ('Rudolph jaquard', 5),\n",
       " ('Romeo Hood', 5),\n",
       " ('Rollerneck Etienne', 5),\n",
       " ('Rollerneck Charlie TVP', 5),\n",
       " ('Rollerneck Blenheim TVP', 5),\n",
       " ('Roll Up Tee', 5),\n",
       " ('Roger TVP', 5),\n",
       " ('Rodney Sweater', 5),\n",
       " ('Rock Fancy Relaxed Shorts', 5),\n",
       " ('Robin 5pk Fancy', 5),\n",
       " ('Robin 3pk R basic short trunk', 5),\n",
       " ('Robin 3pk Fancy', 5),\n",
       " ('Ritz flip flop OL', 5),\n",
       " ('Ripley r-neck', 5),\n",
       " ('Ripley R-neck', 5),\n",
       " ('Ripley Col. Block', 5),\n",
       " ('Rincon L/S', 5),\n",
       " ('Rig Tee', 5),\n",
       " ('Ridge', 5),\n",
       " ('Rico half zip', 5),\n",
       " ('Raymond 5 pk', 5),\n",
       " ('Randall R-Neck', 5),\n",
       " ('Ramsey washed out', 5),\n",
       " ('Ramsey R-neck', 5),\n",
       " ('Raf velour crewneck', 5),\n",
       " ('Rachel L/S', 5),\n",
       " ('ROY SLIM RN T-SHIRT', 5),\n",
       " ('RONNY FANCY', 5),\n",
       " ('REX SLIM LS T-SHIRT', 5),\n",
       " ('RC legolas resort shirt', 5),\n",
       " ('RC CIDER STRIPE TEE', 5),\n",
       " ('RC BORIS SHIRT.', 5),\n",
       " ('RC BENSON SHORTS', 5),\n",
       " ('R-neck William', 5),\n",
       " ('R-neck Tasker', 5),\n",
       " ('R-neck Livorno', 5),\n",
       " ('R-neck Isac', 5),\n",
       " ('R-neck Corso', 5),\n",
       " ('R-neck Chevron', 5),\n",
       " ('R-neck Camden R', 5),\n",
       " ('R-neck Brian', 5),\n",
       " ('R-neck Animal', 5),\n",
       " ('R-neck Alex', 5),\n",
       " ('R-Neck SS Slim ONLINE', 5),\n",
       " ('R-Neck Pisa TVP', 5),\n",
       " ('R-Neck Owen', 5),\n",
       " ('R-Neck Merino Pisa', 5),\n",
       " ('R-Neck Jamber', 5),\n",
       " ('R-NECK SS SLIM FIT', 5),\n",
       " ('R-NECK LS SLIM FIT', 5),\n",
       " ('R-NECK LS BASIC FIT FANCY', 5),\n",
       " ('R-NECK LS BASIC FIT', 5),\n",
       " ('R-NECK BASIC FIT FANCY', 5),\n",
       " ('Puff hairy sweater', 5),\n",
       " ('Printed CF Sweatshirt 19.99:-', 5),\n",
       " ('Pradam LS Polo Shirt', 5),\n",
       " ('Pontus Espadrill.', 5),\n",
       " ('Polo ss Silas', 5),\n",
       " ('Polo S/S Highline', 5),\n",
       " ('Polo LS Kane', 5),\n",
       " ('Polo L/S Metallica!', 5),\n",
       " ('Polly sweater', 5),\n",
       " ('Polly', 5),\n",
       " ('Pluto stripe tee', 5),\n",
       " ('Pip crewneck', 5),\n",
       " ('Pip AOP sweather', 5),\n",
       " ('Pip', 5),\n",
       " ('Pia Party', 5),\n",
       " ('Peter waffleknit', 5),\n",
       " ('Peter Polo OL', 5),\n",
       " ('Pete crewneck TP', 5),\n",
       " ('Pete crewneck', 5),\n",
       " ('Pete bd ls poplin', 5),\n",
       " ('Pete Slim Shorts', 5),\n",
       " ('Petar Sweater', 5),\n",
       " ('Pernilla Jumper', 5),\n",
       " ('Penny', 5),\n",
       " ('Pennstation Sweater', 5),\n",
       " ('Pat ls bd stripe', 5),\n",
       " ('Pat ls bd oxford stripe', 5),\n",
       " ('Pat ls bd oxford', 5),\n",
       " ('Parker tanktop', 5),\n",
       " ('Parker tank top', 5),\n",
       " ('Paris stripe knit', 5),\n",
       " ('Panelled Sweater', 5),\n",
       " ('Palermo sweater', 5),\n",
       " ('Paddington DEAL', 5),\n",
       " ('Paddington Crewneck', 5),\n",
       " ('Pack Striped', 5),\n",
       " ('PURE V-neck', 5),\n",
       " ('PRINCE ERIC BASIC TEE', 5),\n",
       " ('PRICE CLASSIC FIT CREW NECK', 5),\n",
       " ('PIPER POLO', 5),\n",
       " ('PINE crewneck cotton cashmere', 5),\n",
       " ('PIAZZA MICRO CABLE R-NECK', 5),\n",
       " ('PHOENIX', 5),\n",
       " ('PHANTOM DOGTOOTH SWEATER', 5),\n",
       " ('PETER POLO', 5),\n",
       " ('PETAR SWEATSHIRT', 5),\n",
       " ('PENN HENLEY LS', 5),\n",
       " ('PEBBLE reg cashmere crewneck', 5),\n",
       " ('PEBBLE knitted crewneck 1', 5),\n",
       " ('PEBBLE knitted creweck', 5),\n",
       " ('PAUL V-NECK', 5),\n",
       " ('PAUL R-NECK MERINO', 5),\n",
       " ('PASTRY SWEATER', 5),\n",
       " ('PARSLEY merino saddle sleeve', 5),\n",
       " ('PABLO MUSCLE MOCKNECK', 5),\n",
       " ('Olof towel L/S', 5),\n",
       " ('Oliver hood', 5),\n",
       " ('OTTO FLEECE HOOD', 5),\n",
       " ('ORBIT SHAWLCOLLAR CARDIGAN', 5),\n",
       " ('OPAL SWEATER', 5),\n",
       " ('OLIVER OXFORD SHIRT', 5),\n",
       " ('OCEAN swimshorts', 5),\n",
       " ('OCEAN swim shorts', 5),\n",
       " ('OAKLAND L/S STRIPE', 5),\n",
       " ('Nohar Sneaker', 5),\n",
       " ('Noah hood', 5),\n",
       " ('Nils sweater Top product', 5),\n",
       " ('Nils sweater', 5),\n",
       " ('Nathan r-neck', 5),\n",
       " ('Nat ss stripe', 5),\n",
       " ('Nat ls linnen stripe', 5),\n",
       " ('Nat SS AOP Stripe', 5),\n",
       " ('Nasa crewneck 1', 5),\n",
       " ('Nasa crewneck', 5),\n",
       " ('Nancy', 5),\n",
       " ('NYLON SIDE STRIPE', 5),\n",
       " ('NUTMEG SWEATER', 5),\n",
       " ('NORA', 5),\n",
       " ('NICOLE SWEATER', 5),\n",
       " ('NICOLE', 5),\n",
       " ('NEWPORT SHAWL COLLAR(1)', 5),\n",
       " ('NASA Sweater 24.99:-', 5),\n",
       " ('N Agnes knitted sweater', 5),\n",
       " ('Molly', 5),\n",
       " ('Mockneck Mendoza', 5),\n",
       " ('Mischa 3pk Fancy', 5),\n",
       " ('Mischa 3pk Basic brief', 5),\n",
       " ('Mini Clement', 5),\n",
       " ('Mikkelsen 1/2 Zip', 5),\n",
       " ('Micke printed block', 5),\n",
       " ('Micke crew color block', 5),\n",
       " ('Merlin 12gg', 5),\n",
       " ('Memphis', 5),\n",
       " ('Max tee', 5),\n",
       " ('Max stripe pack', 5),\n",
       " ('Mary Top', 5),\n",
       " ('Mary LS', 5),\n",
       " ('Marvin tee', 5),\n",
       " ('Martin Regular Mandarin', 5),\n",
       " ('Markus r-neck strucutre', 5),\n",
       " ('Markus r-neck structure', 5),\n",
       " ('Markus', 5),\n",
       " ('Mandarin Coma', 5),\n",
       " ('Magic cropped sweater', 5),\n",
       " ('Mads knitted roundneck', 5),\n",
       " ('Mad mockneck L/S', 5),\n",
       " ('MUSHROOM POLO', 5),\n",
       " ('MOMO cropt top', 5),\n",
       " ('MINERAL CREW', 5),\n",
       " ('MEMPHIS SWEATER', 5),\n",
       " ('MEDALLION JACQUARD', 5),\n",
       " ('MAXENCE TEE', 5),\n",
       " ('MAX CHECKS AND STRIPES 3PK', 5),\n",
       " ('MASON C-NECK', 5),\n",
       " ('MALDON MOCKNECK', 5),\n",
       " ('MAITAKE SLIM FIT CONSIOUS POLO', 5),\n",
       " ('MAGIC CREWNECK', 5),\n",
       " ('MAGIC CREW TP', 5),\n",
       " ('Ludwig crewneck', 5),\n",
       " ('Ludvig sweater(1)', 5),\n",
       " ('Ludvig sweater', 5),\n",
       " ('Ludvig roundneck', 5),\n",
       " ('Lucky crewneck ICONS', 5),\n",
       " ('Lucky crewneck', 5),\n",
       " ('Lucas linen shirt', 5),\n",
       " ('Longsleeve Tee', 5),\n",
       " ('Leonardo cardigan', 5),\n",
       " ('Leon hood', 5),\n",
       " ('Legolas SS', 5),\n",
       " ('Lee spring hood', 5),\n",
       " ('Lee hood', 5),\n",
       " ('Lava Jumper', 5),\n",
       " ('Laurent slim fit jogger old', 5),\n",
       " ('Lance shirt', 5),\n",
       " ('Lance Hood', 5),\n",
       " ('Lance', 5),\n",
       " ('Lagoon Sportstripe Sweater', 5),\n",
       " ('Lady', 5),\n",
       " ('LIBRA STRIPE SHIRT', 5),\n",
       " ('LAVENDER half zip', 5),\n",
       " ('LARRY LS HENLEY', 5),\n",
       " ('LARK half zip', 5),\n",
       " ('L/S Polo Gnocci TVP', 5),\n",
       " ('Kriss one shoulder', 5),\n",
       " ('Kompis L/S fancy', 5),\n",
       " ('Knoxville Half Zip', 5),\n",
       " ('Kelly', 5),\n",
       " ('Keith spring sweater', 5),\n",
       " ('Karl Preppy Belt(1)', 5),\n",
       " ('Karl Preppy Belt 2', 5),\n",
       " ('KARATE SWEATER', 5),\n",
       " ('Juan V neck', 5),\n",
       " ('Jousha Hood', 5),\n",
       " ('Josh Webbing Belt Stripe', 5),\n",
       " ('Jeff zip pocket', 5),\n",
       " ('Jeff sweater', 5),\n",
       " ('Jeff o/d pullon', 5),\n",
       " ('Jax', 5),\n",
       " ('James B R-neck', 5),\n",
       " ('Jacquard Chrismas Knit', 5),\n",
       " ('Jacob sweater', 5),\n",
       " ('Jack pile', 5),\n",
       " ('Jack AOP', 5),\n",
       " ('JEKYL TWIST SWEATSHIRT', 5),\n",
       " ('JEKYL SWEATSHIRT', 5),\n",
       " ('JALEN', 5),\n",
       " ('JAKE WOVEN TRS', 5),\n",
       " ('Ivy', 5),\n",
       " ('Isabella', 5),\n",
       " ('ISAAC RXD RN T-SHIRT', 5),\n",
       " ('IRON sweater', 5),\n",
       " ('IRON crewneck Merino', 5),\n",
       " ('INC rollerneck lambswool', 5),\n",
       " ('INC chunky rollerneck', 5),\n",
       " ('ICE striped linen tee', 5),\n",
       " ('ICE organic linen tee', 5),\n",
       " ('ICE linen tee', 5),\n",
       " ('Håkan half zip CC', 5),\n",
       " ('Houdini check crewneck', 5),\n",
       " ('Henry polo', 5),\n",
       " ('Henrik hood', 5),\n",
       " ('Henrik c-neck', 5),\n",
       " ('Henrik OH hood (1)', 5),\n",
       " ('Henley sweater', 5),\n",
       " ('Harvey hood', 5),\n",
       " ('Harry hood stripe', 5),\n",
       " ('Harry', 5),\n",
       " ('Harrison short sleeve top CN', 5),\n",
       " ('Hans r-neck', 5),\n",
       " ('Hampsted drawstring trs', 5),\n",
       " ('HENDRICKS CREWNECK', 5),\n",
       " ('Gustav skinny stripe trs', 5),\n",
       " ('Gustav skinny stripe blz', 5),\n",
       " ('Greg print', 5),\n",
       " ('Gihon Panel Lurex', 5),\n",
       " ('GREEN PEA SWEATER', 5),\n",
       " ('GREEN PEA R-NECK', 5),\n",
       " ('GINGER crewneck', 5),\n",
       " ('GARETH L/S 2-pack', 5),\n",
       " ('GARETH L/S', 5),\n",
       " ('Frida Printed Sweater', 5),\n",
       " ('Freddy stripe', 5),\n",
       " ('Franz Rugby Shirt', 5),\n",
       " ('Frame Slim SS', 5),\n",
       " ('Flock', 5),\n",
       " ('Felix high neck w patch', 5),\n",
       " ('Feild OH hood CC', 5),\n",
       " ('Fawn color block', 5),\n",
       " ('Fav polo fancy', 5),\n",
       " ('Family crew Mens', 5),\n",
       " ('Family Crew Ladies', 5),\n",
       " ('Family Crew Kids', 5),\n",
       " ('FROST crewneck', 5),\n",
       " ('FROST cotton/cashmere sweater', 5),\n",
       " ('FRANKLIN HOOD', 5),\n",
       " ('FRAME Easy Iron fancy', 5),\n",
       " ('FRAME Easy Iron S9', 5),\n",
       " ('FRAME Easy Iron', 5),\n",
       " ('FRAME Easy Care TVP', 5),\n",
       " ('FORTUNA TEE', 5),\n",
       " ('FORTUNA', 5),\n",
       " ('FLOYD FUNNELNECK', 5),\n",
       " ('FINE KNIT', 5),\n",
       " ('FIG', 5),\n",
       " ('FESTIVAL Jimmy Dungaree', 5),\n",
       " ('FESTIVAL Denim Jkt', 5),\n",
       " ('FERGUS POLAR FLEECE', 5),\n",
       " ('FALL cardigan', 5),\n",
       " ('Even painted floral CS', 5),\n",
       " ('Ethan Sweater', 5),\n",
       " ('Embroidered statement knit', 5),\n",
       " ('Ece fleece', 5),\n",
       " ('ES Sullivan crew', 5),\n",
       " ('ES Sean Crewneck', 5),\n",
       " ('ES Alba', 5),\n",
       " ('ERIK REG TANK TOP', 5),\n",
       " ('ERIK 2PK REG TANK TOP', 5),\n",
       " ('Dylan Aop/solid shorts', 5),\n",
       " ('Dorotea knitted jumper', 5),\n",
       " ('Dion LS Crewneck', 5),\n",
       " ('Devon basic sweater', 5),\n",
       " ('Danny windbreaker', 5),\n",
       " ('DOUG l/s fancy polo', 5),\n",
       " ('DON Tee', 5),\n",
       " ('DIXIE', 5),\n",
       " ('DEAN CORD JKT', 5),\n",
       " ('DANNY LS TEE', 5),\n",
       " ('Crowd printed hood', 5),\n",
       " ('Corsica', 5),\n",
       " ('Conny', 5),\n",
       " ('Colin Stripe Shawl Sweater', 5),\n",
       " ('Cloud stripe LS', 5),\n",
       " ('Claus jaquard', 5),\n",
       " ('Claus chrismtas jaquard', 5),\n",
       " ('Christmas Mini Me', 5),\n",
       " ('Chris 5pk R Basic mid trunks', 5),\n",
       " ('Chris 5pk', 5),\n",
       " ('Chris 3pk fancy', 5),\n",
       " ('Chris 3pk R basic mid trunks', 5),\n",
       " ('Chris 3pk Fancy new', 5),\n",
       " ('Cher sweater', 5),\n",
       " ('Chandler crewneck', 5),\n",
       " ('Calvin crewneck', 5),\n",
       " ('Calum cableknit r-neck', 5),\n",
       " ('CURRY POLO', 5),\n",
       " ('CSP WON TON BOMBER', 5),\n",
       " ('COZY LIPP', 5),\n",
       " ('COWBOY DENIM SHIRT', 5),\n",
       " ('CORN CLASSIC TEE', 5),\n",
       " ('CNY MAN PRICEITEM', 5),\n",
       " ('CNY FORTUNE HOOD', 5),\n",
       " ('CNY CHINA TOWN CREW', 5),\n",
       " ('CLEMENTINE saddle sleeve', 5),\n",
       " ('CHROME CREWNECK PROGRAM', 5),\n",
       " ('CHLOÈ', 5),\n",
       " ('CEDAR SHAWLCOLLAR', 5),\n",
       " ('CASSIM ROLLNECK', 5),\n",
       " ('CASSIM MERINO SLIM ROLLNECK', 5),\n",
       " ('CASSIM', 5),\n",
       " ('CAGE SLIM EASY IRON US', 5),\n",
       " ('CA Hugh Linen shirt TVP R', 5),\n",
       " ('CA Gustavsberg TVP', 5),\n",
       " ('CA Berlin', 5),\n",
       " ('Bruce skinny 5 pkt fancy', 5),\n",
       " ('Britta price swettis', 5),\n",
       " ('Brayden funnel neck', 5),\n",
       " ('Braces Will stripe', 5),\n",
       " ('Bonnie', 5),\n",
       " ('Blank espadrill', 5),\n",
       " ('Bella', 5),\n",
       " ('Bateman Cable', 5),\n",
       " ('Basic bonded jersey sweater', 5),\n",
       " ('Barolo LS knot', 5),\n",
       " ('Barney henley', 5),\n",
       " ('Bama', 5),\n",
       " ('Badger price', 5),\n",
       " ('Badger Price', 5),\n",
       " ('BYRON STRUCTURE SWEATER', 5),\n",
       " ('BRYSON PILE jacket', 5),\n",
       " ('BRUCE CREWNECK', 5),\n",
       " ('BRUCE CREW TP', 5),\n",
       " ('BRIDGET Sweater', 5),\n",
       " ('BRADLEY SLIM LS HENLEY', 5),\n",
       " ('BRAD PRINT', 5),\n",
       " ('BORIS', 5),\n",
       " ('BOB PRINT', 5),\n",
       " ('BIRD drapy shirt', 5),\n",
       " ('BIRCH crewneck lambswool', 5),\n",
       " ('BILL SS HENLEY', 5),\n",
       " ('BENNY fancy crew BB', 5),\n",
       " ('BENJAMIN CORD SHIRT', 5),\n",
       " ('BEN fancy crewneck SB NEW', 5),\n",
       " ('BEN fancy crewneck SB', 5),\n",
       " ('BEN fancy crewneck', 5),\n",
       " ('BEE twist crewneck', 5),\n",
       " ('BEE TEE', 5),\n",
       " ('BECKETT SET', 5),\n",
       " ('BEAN', 5),\n",
       " ('BEACH graphic crewneck', 5),\n",
       " ('BD Richard oxford PQ TVP', 5),\n",
       " ('BAY crewneck', 5),\n",
       " ('BARRY BURN OUT HENLEY', 5),\n",
       " ('BALOO CREW', 5),\n",
       " ('BADGER PRICE', 5),\n",
       " ('Aster knit', 5),\n",
       " ('Ashley r-neck structure', 5),\n",
       " ('Arthur slim fit shirt', 5),\n",
       " ('Arron solid', 5),\n",
       " ('Arron Navajo jaquard', 5),\n",
       " ('Apollo l/s', 5),\n",
       " ('Anthony Fancy', 5),\n",
       " ('Anthony 3pk Basic', 5),\n",
       " ('Andreas r-neck', 5),\n",
       " ('Amelia sweater', 5),\n",
       " ('Allen Sweater', 5),\n",
       " ('Alexander knitted mockneck', 5),\n",
       " ('AVOCADO HOOD', 5),\n",
       " ('ASTER slim roller Merino TVP', 5),\n",
       " ('ASTER co/cash rollerneck', 5),\n",
       " ('ASTER cashmere rollerneck', 5),\n",
       " ('ARTICHOKE SLIM FIT POLO', 5),\n",
       " ('ARIZONA stripe', 5),\n",
       " ('ANDY FANCY L/S', 5),\n",
       " ('ANDREAS CORD TROUSERS', 5),\n",
       " ('ANDERS LS POLO', 5),\n",
       " ('ALBIN basic rib 2p SB', 5),\n",
       " ('ALASKA mockneck sweater', 5),\n",
       " ('ALABASTER roundneck', 5),\n",
       " ('AK Juniper jumper', 5),\n",
       " ('99-STUDIO FOURTYTHREE CAP', 5),\n",
       " ('7pk sneaker fancy', 5),\n",
       " ('5pk regular fancy', 5),\n",
       " ('5pk invisble sock', 5),\n",
       " ('58-Studio Ricky tee', 5),\n",
       " ('56-STUDIO ANDREAS CORD TRS', 5),\n",
       " ('52-Studio Mr coat', 5),\n",
       " ('52-STUDIO TWENTYNINE PEACOAT', 5),\n",
       " ('3PK R-NECK SS SLIM', 5),\n",
       " ('3PK R-NECK LS SLIM', 5),\n",
       " ('3 PK R-NECK SS BASIC', 5),\n",
       " ('2 PK PETER POLO', 5),\n",
       " ('2 PK BILL HENLEY', 5),\n",
       " ('1pk end on end', 5),\n",
       " ('1pk Basic', 5),\n",
       " ('x-size Benny pull-on shorts', 4),\n",
       " ('wayne knit', 4),\n",
       " ('tho', 4),\n",
       " ('simon Printed L/S', 4),\n",
       " ('ragnarök', 4),\n",
       " ('prince padded shirt/overshirt', 4),\n",
       " ('popon shorts', 4),\n",
       " ('peach', 4),\n",
       " ('id', 4),\n",
       " ('douglas denim SS', 4),\n",
       " ('cooper jersey slack', 4),\n",
       " ('cleo tunic', 4),\n",
       " ('christian knit polo', 4),\n",
       " ('bill checked shirt', 4),\n",
       " ('basic tankoverall', 4),\n",
       " ('Zorro half-zip sweater', 4),\n",
       " ('Zita Dress', 4),\n",
       " ('Zinnia dress (1)', 4),\n",
       " ('Ziggy Linnen LS', 4),\n",
       " ('Zidane blouse', 4),\n",
       " ('Zero Tee', 4),\n",
       " ('Zebra- TVP- TM', 4),\n",
       " ('Zebra wide trouser stripe', 4),\n",
       " ('Zebra sweater', 4),\n",
       " ('Zebra sweat - TVP', 4),\n",
       " ('Zack Tee', 4),\n",
       " ('ZEN SHORTS', 4),\n",
       " ('ZEBRA CF TVP', 4),\n",
       " ('Ystad', 4),\n",
       " ('Yoshi casual hood', 4),\n",
       " ('Yate hood', 4),\n",
       " ('YAAS sailor', 4),\n",
       " ('Wrap Queen top', 4),\n",
       " ('Wow printed tee 6.99', 4),\n",
       " ('Wow Rocky Regular Tee 4.99:-', 4),\n",
       " ('Wow Rispan Hood 19.99:-', 4),\n",
       " ('Woven PJ', 4),\n",
       " ('Wool Scarf Akira', 4),\n",
       " ('Wolfgang Skinny Blz', 4),\n",
       " ('Wolf Coat', 4),\n",
       " ('Wisteria', 4),\n",
       " ('Winston wool bomber', 4),\n",
       " ('Winston bomber', 4),\n",
       " ('Willow set', 4),\n",
       " ('William shacket w lining', 4),\n",
       " ('William fb s/s tee', 4),\n",
       " ('William', 4),\n",
       " ('Wilhelm tee', 4),\n",
       " ('Wet Tee (1)', 4),\n",
       " ('West Hood Jacket', 4),\n",
       " ('Werner sweater', 4),\n",
       " ('Weekend sweater', 4),\n",
       " ('Way chimney coat', 4),\n",
       " ('Wave linen', 4),\n",
       " ('Wave Sweater', 4),\n",
       " ('Wave Relaxed Shorts', 4),\n",
       " ('Wave Relaxed Linen Trs', 4),\n",
       " ('Wave Linen Relaxed fit PID', 4),\n",
       " ('Wassy dress', 4),\n",
       " ('Warren 3p Coolmax', 4),\n",
       " ('Wander V-neck', 4),\n",
       " ('Wales recylce sweater', 4),\n",
       " ('Waleo HW wide full', 4),\n",
       " ('Waif Wide leg trouser RW', 4),\n",
       " ('WREN slim fit tee', 4),\n",
       " ('WM CHESHIRE CLASSIC TEE', 4),\n",
       " ('WIM price l/s tee', 4),\n",
       " ('WILMA WRAP BLOUSE', 4),\n",
       " ('WILLOW sweater', 4),\n",
       " ('WILLOW RIB 2p', 4),\n",
       " ('WENDY LEGGINGS', 4),\n",
       " ('WEEKEND SWETTIS', 4),\n",
       " ('WAVE REL LINEN SHORTS', 4),\n",
       " ('WASABI POLO', 4),\n",
       " ('WAFFLE L/S CTN basic', 4),\n",
       " ('W GENOVA TRS EQ', 4),\n",
       " ('W Bath trousers EQ', 4),\n",
       " ('Vulcano metallic tee', 4),\n",
       " ('Vovve shorts', 4),\n",
       " ('Visby 5-pkt', 4),\n",
       " ('Virginia shorts', 4),\n",
       " ('Virginia pull-on shorts', 4),\n",
       " ('Viola wrap dress', 4),\n",
       " ('Vinci slim fit shorts', 4),\n",
       " ('Vincent light Blz', 4),\n",
       " ('Vincent Trs', 4),\n",
       " ('Vilde top', 4),\n",
       " ('Vilde 2p TVP', 4),\n",
       " ('Viktor Hoody', 4),\n",
       " ('Victory runner', 4),\n",
       " ('Victoria RW Pull- On TRS', 4),\n",
       " ('Vicky tapered HW', 4),\n",
       " ('Vesuvius faded check tee', 4),\n",
       " ('Vesper', 4),\n",
       " ('Verity V-neck', 4),\n",
       " ('Venice pullon', 4),\n",
       " ('Valter pj SB', 4),\n",
       " ('Valle valentine sweater', 4),\n",
       " ('VIOLET set', 4),\n",
       " ('VINCENT SWEATPANTS', 4),\n",
       " ('VINCE SHORTS', 4),\n",
       " ('VERA Tank', 4),\n",
       " ('VENUS OTS', 4),\n",
       " ('VENUS OFF SHOULDER', 4),\n",
       " ('VENICE hood deal', 4),\n",
       " ('VELOUR hoodie', 4),\n",
       " ('VALERIE dress (1)', 4),\n",
       " ('VALENTINE Rain L/S', 4),\n",
       " ('VALENTINE Clint Tee 2pack', 4),\n",
       " ('VALENTINE Clint Tee', 4),\n",
       " ('VALENTINE Beanie 2pack', 4),\n",
       " ('V-NECK SS BASIC 3 PK', 4),\n",
       " ('Uranus Parka', 4),\n",
       " ('Uno', 4),\n",
       " ('Unit puffer', 4),\n",
       " ('Una jumpsuit', 4),\n",
       " ('Ulrik', 4),\n",
       " ('UNI SUN ss tee stripe', 4),\n",
       " ('UNI DAY ls', 4),\n",
       " ('Tywin sneaker PQ', 4),\n",
       " ('Tyrion', 4),\n",
       " ('Tyko fancy', 4),\n",
       " ('Tyko', 4),\n",
       " ('Two Sherling Jacket', 4),\n",
       " ('Twist tee', 4),\n",
       " ('Tulip jumper', 4),\n",
       " ('Tulip blouse S.L', 4),\n",
       " ('Tulip Sweater', 4),\n",
       " ('Tulip', 4),\n",
       " ('Trosa onezie SB', 4),\n",
       " ('Trisha tee dress(1)', 4),\n",
       " ('Tripoli dress', 4),\n",
       " ('Trick chinos', 4),\n",
       " ('Trick Chino', 4),\n",
       " ('Transeasonal trousers', 4),\n",
       " ('Tracy skirt', 4),\n",
       " ('Tracy', 4),\n",
       " ('Totte Set', 4),\n",
       " ('Toto jumpsuit', 4),\n",
       " ('Toronto Joggers 24.99:-', 4),\n",
       " ('Tora dress', 4),\n",
       " ('Tora', 4),\n",
       " ('Topi dress J', 4),\n",
       " ('Topi Dress J.', 4),\n",
       " ('Topher Leather Belt', 4),\n",
       " ('Tommy ls tee 2-pack', 4),\n",
       " ('Tommy jogger', 4),\n",
       " ('Tommy LS 2P', 4),\n",
       " ('Tommy 2-p', 4),\n",
       " ('Tomato knit', 4),\n",
       " ('Tom tape', 4),\n",
       " ('Tom solid', 4),\n",
       " ('Tom coach', 4),\n",
       " ('Tom blocking', 4),\n",
       " ('Tobin trackpants', 4),\n",
       " ('Tobias ls', 4),\n",
       " ('Tobias DE Low-Price', 4),\n",
       " ('Tobias', 4),\n",
       " ('Tintin Tunic Dress', 4),\n",
       " ('Tina NT l/s', 4),\n",
       " ('Tina LS', 4),\n",
       " ('Timeless Top', 4),\n",
       " ('Timeless Tie Tanga', 4),\n",
       " ('Timeless Tanga', 4),\n",
       " ('Timeless Push Triangle(1)', 4),\n",
       " ('Timeless Padded Swimsuit', 4),\n",
       " ('Timeless Padded Bra', 4),\n",
       " ('Timeless Midrise Brief', 4),\n",
       " ('Timeless Mid Rise Hipster', 4),\n",
       " ('Timeless Highwaist', 4),\n",
       " ('Timeless High Rise Hipster', 4),\n",
       " ('Tilly (1)', 4),\n",
       " ('Tillman Polo cardigan', 4),\n",
       " ('Tilda.', 4),\n",
       " ('Tiffany dress', 4),\n",
       " ('Tierp OTS blouse', 4),\n",
       " ('Tie Tiko Paisly 55mm', 4),\n",
       " ('Tie Spotty', 4),\n",
       " ('Tie Mini Dot', 4),\n",
       " ('Tie MC Thomas Texture', 4),\n",
       " ('Tie MC Basic Silk Rips 7cm', 4),\n",
       " ('Tie MC 7cm AOP Dot', 4),\n",
       " ('Tie Jeeves 6cm', 4),\n",
       " ('Tie Jan Structure', 4),\n",
       " ('Tie Flowers', 4),\n",
       " ('Tie Christmas Jaquard', 4),\n",
       " ('Tie Christmas Jacquard', 4),\n",
       " ('Tie Basic Solid Wide Concious', 4),\n",
       " ('Tie Basic Solid Wide', 4),\n",
       " ('Tie Basic Solid Conscious', 4),\n",
       " ('Tie Basic Silk Rips 7cm', 4),\n",
       " ('Tie Basic Silk Rips 6cm', 4),\n",
       " ('Tie Animal Embroidery', 4),\n",
       " ('Tie 7cm Mickey DOT', 4),\n",
       " ('Tie 7cm AOP DOT', 4),\n",
       " ('Tie 2-pack poly rips', 4),\n",
       " ('Tie 2-pack Summer Floral', 4),\n",
       " ('Thomas zip bomber', 4),\n",
       " ('Thomas paperbag wide', 4),\n",
       " ('Thomas linen shorts', 4),\n",
       " ('Thomas jogger', 4),\n",
       " ('Theresea cropped shirt', 4),\n",
       " ('Theon tie-waist jumpsuit', 4),\n",
       " ('The Boss', 4),\n",
       " ('Texas navy v.5', 4),\n",
       " ('Tessan l/s Blouse', 4),\n",
       " ('Tessan blouse', 4),\n",
       " ('Tessa plissè', 4),\n",
       " ('Tess Tee', 4),\n",
       " ('Tess Sl-set DTP (W)', 4),\n",
       " ('Terry slip-on shoe', 4),\n",
       " ('Terry 2-p antislip SB', 4),\n",
       " ('Terrier TM', 4),\n",
       " ('Tequila denim/fancy shorts', 4),\n",
       " ('Telia shirt', 4),\n",
       " ('Teddy jogger.', 4),\n",
       " ('Tech Stretch Slim', 4),\n",
       " ('Tech Stretch Skinny', 4),\n",
       " ('Taylor blouse', 4),\n",
       " ('Taylor (1)', 4),\n",
       " ('Tatjana Structure', 4),\n",
       " ('Tara turtleneck top', 4),\n",
       " ('Tapered Midprice(1)', 4),\n",
       " ('Tank top+bloomers set', 4),\n",
       " ('Tanja tank', 4),\n",
       " ('Tanja dress', 4),\n",
       " ('Tammy', 4),\n",
       " ('TVP VILDE 2P LS TEE', 4),\n",
       " ('TVP TOBIAS LS TEE', 4),\n",
       " ('TVP Sprout sweater', 4),\n",
       " ('TVP SVENNE SET (CC)', 4),\n",
       " ('TVP SIXTEN SWEATER', 4),\n",
       " ('TVP ROGER SWEATER', 4),\n",
       " ('TVP Nicolas roll-up', 4),\n",
       " ('TVP Jason shirt', 4),\n",
       " ('TVP GUNDE LS BODY', 4),\n",
       " ('TVP Alvin set', 4),\n",
       " ('TVP Abbe shorts', 4),\n",
       " ('TUSSIE knot crew', 4),\n",
       " ('TURIN w. braces', 4),\n",
       " ('TUNIS LS single (1)', 4),\n",
       " ('TUCK CLASSIC SWEATPANTS', 4),\n",
       " ('TUCK CLASSIC JOGGER', 4),\n",
       " ('TRACEY LS TEE', 4),\n",
       " ('TRACEY LONG SLEEVE', 4),\n",
       " ('TP Visby 5-pkt', 4),\n",
       " ('TP Valter l/l pj SB', 4),\n",
       " ('TP Torkel 2-pack tanktop', 4),\n",
       " ('TP Stellan shaftless SB 7-p', 4),\n",
       " ('TP Stellan 7-p shaftless SB', 4),\n",
       " ('TP Stellan 7-p shaftless B (1)', 4),\n",
       " ('TP Princeton shirt', 4),\n",
       " ('TP Princeton LS shirt', 4),\n",
       " ('TP Oscar l/s SB NEW', 4),\n",
       " ('TP NEW Sixten 3-p boxer BB', 4),\n",
       " ('TP NEW Henrik 3-p boxer BB.', 4),\n",
       " ('TP NEW Axel 5-p anklesock SB', 4),\n",
       " ('TP JACK fancy hood SB', 4),\n",
       " ('TP Håkan  Sweater', 4),\n",
       " ('TP Henrik 3-p boxer BB', 4),\n",
       " ('TP Euston Sweater', 4),\n",
       " ('TP Daniel 3-p boxer SB', 4),\n",
       " ('TP Axel anklesock BB 5-p', 4),\n",
       " ('TP Axel 5-p anklesock SB', 4),\n",
       " ('TP Axel 5-p anklesock BB', 4),\n",
       " ('TP Adam 2-p long john BB', 4),\n",
       " ('TORKEL Basic 2-pack tanktop SB', 4),\n",
       " ('TORI DRESS', 4),\n",
       " ('TORBJORN 3-p LS BB', 4),\n",
       " ('TOM tank 2-pack', 4),\n",
       " ('TOM TANK', 4),\n",
       " ('TOM SOLID', 4),\n",
       " ('TOM L/S Fancy basic', 4),\n",
       " ('TOM BLOCKING R-NECK', 4),\n",
       " ('TOBY romper', 4),\n",
       " ('TOBY overall', 4),\n",
       " ('TOBIE l/s SB 5-p', 4),\n",
       " ('TOBIAS henley', 4),\n",
       " ('TOBIAS FANCY TEE', 4),\n",
       " ('TOBI NASA PJ SET', 4),\n",
       " ('TITUS jaquard', 4),\n",
       " ('TIMOTHY PJ HOOD SET', 4),\n",
       " ('TILLIE dress', 4),\n",
       " ('TIBLISI PAPERBAG SLACKS', 4),\n",
       " ('THEO fancy hood BB', 4),\n",
       " ('THEO ROLL NECK', 4),\n",
       " ('THEA set', 4),\n",
       " ('TECH Miro Carcoat', 4),\n",
       " ('TECH Buck Parka', 4),\n",
       " ('TECH Bradford Cargos', 4),\n",
       " ('TECH Beck Shell Jkt', 4),\n",
       " ('TD stripe Dave', 4),\n",
       " ('TD small dot', 4),\n",
       " ('TD print sky dot', 4),\n",
       " ('TD print Orchid', 4),\n",
       " ('TD print Botanical', 4),\n",
       " ('TD paisley', 4),\n",
       " ('TD flowerbuds', 4),\n",
       " ('TD check big Gingham/OPEN', 4),\n",
       " ('TD check Rossi', 4),\n",
       " ('TD blush dot', 4),\n",
       " ('TD Valentine', 4),\n",
       " ('TD Slugo paisley', 4),\n",
       " ('TD Sergio', 4),\n",
       " ('TD SS Roger', 4),\n",
       " ('TD SS Layeredfloral', 4),\n",
       " ('TD SS Caleb', 4),\n",
       " ('TD Roger eller TD Poplin 29 by', 4),\n",
       " ('TD Paisley GOW', 4),\n",
       " ('TD Morgan smoke dot', 4),\n",
       " ('TD Minidots', 4),\n",
       " ('TD Mika new jaquard', 4),\n",
       " ('TD Linefloral', 4),\n",
       " ('TD Foulard', 4),\n",
       " ('TD Flint stripe', 4),\n",
       " ('TD Drakeford gingham', 4),\n",
       " ('TD Check big gingham', 4),\n",
       " ('TD Byron cord', 4),\n",
       " ('TD Bird print', 4),\n",
       " ('TD AOP animal', 4),\n",
       " ('TD AOP Cttn/viscose', 4),\n",
       " ('TD AOP Cotton PQ', 4),\n",
       " ('TAZ LONG RN T-SHIRT', 4),\n",
       " ('Syster linen popover', 4),\n",
       " ('Sweet pea', 4),\n",
       " ('Sweep chimney coat', 4),\n",
       " ('Sweep chimney', 4),\n",
       " ('Sweatshirt set', 4),\n",
       " ('Sweatshirt 3PACK', 4),\n",
       " ('Swan top', 4),\n",
       " ('Svenne sneaker', 4),\n",
       " ('Svenne fancy basic set', 4),\n",
       " ('Svenne SET', 4),\n",
       " ('Svea Cropped Tank', 4),\n",
       " ('Sussex skinny trs', 4),\n",
       " ('Sussex skinny blz', 4),\n",
       " ('Sushi cardigan', 4),\n",
       " (\"Sushi Cardigan '\", 4),\n",
       " ('Sunshine tunic shirt', 4),\n",
       " ('Sunglasses Josef', 4),\n",
       " ('Sunglasses Jimmy Polarized', 4),\n",
       " ('Sunglasses Hendrix', 4),\n",
       " ('Sunglasses Guana', 4),\n",
       " ('Sunday SL Set', 4),\n",
       " ('Summer strap dress', 4),\n",
       " ('Summer Set', 4),\n",
       " ('Summer Sagat', 4),\n",
       " ('Suki jumpsuit', 4),\n",
       " ('Stud tee', 4),\n",
       " ('Stubbe 2p dungaree', 4),\n",
       " ('Stuart Shirt', 4),\n",
       " ('Stripe LS Tee', 4),\n",
       " ('Straight Selvedge', 4),\n",
       " ('Straight Mezzo 1', 4),\n",
       " ('Straight Mezzo (1)', 4),\n",
       " ('Straight 5pkt Lowprice', 4),\n",
       " ('Straight 5pkt 1', 4),\n",
       " ('Straight 1', 4),\n",
       " ('Stirling shorts', 4),\n",
       " ('Stinger CF', 4),\n",
       " ('Stina', 4),\n",
       " ('Steven pull on', 4),\n",
       " ('Steve shirt TP', 4),\n",
       " ('Steve check slim trs', 4),\n",
       " ('Steve check slim blz', 4),\n",
       " ('Stella Pull on TRS', 4),\n",
       " ('Stavanger fleece', 4),\n",
       " ('Stardust', 4),\n",
       " ('Stacy', 4),\n",
       " ('Spruce Espadrille PQ', 4),\n",
       " ('Sprout cut knit sweater', 4),\n",
       " ('Spring trousers', 4),\n",
       " ('Sporty spice top', 4),\n",
       " ('Sporty Spice Highwaist Brazil', 4),\n",
       " ('Spencer Shirt Sweater', 4),\n",
       " ('Speed Shelby sweater', 4),\n",
       " ('Spartan waist coat', 4),\n",
       " ('Spartan slim trs', 4),\n",
       " ('Spartan slim blz', 4),\n",
       " ('Spartan TRS', 4),\n",
       " ('Spartan BLZ', 4),\n",
       " ('Sparling slim fit', 4),\n",
       " ('Sparling skinny trs', 4),\n",
       " ('Sparling skinny blz', 4),\n",
       " ('Sparkle jumper', 4),\n",
       " ('Sparkle', 4),\n",
       " ('Spanx alot shape Swimsuit', 4),\n",
       " ('Sorrelli', 4),\n",
       " ('Sorrel(1)', 4),\n",
       " ('Sony LS Oxf Bandcollar', 4),\n",
       " ('Sonny Denim 2', 4),\n",
       " ('Sonny Denim', 4),\n",
       " ('Sonette Bow', 4),\n",
       " ('Son V-neck', 4),\n",
       " ('Softish Hood', 4),\n",
       " ('Snow chino TVP RW', 4),\n",
       " ('Snow Chino R.W', 4),\n",
       " ('Smedby blouse', 4),\n",
       " ('Smedby', 4),\n",
       " ('Slurp long tregging', 4),\n",
       " ('Slim Super Soft Premiumprice', 4),\n",
       " ('Slim Straight Supreme Comfort', 4),\n",
       " ('Slim Straight 5pkt Midway 1', 4),\n",
       " ('Slim Straight 5pkt Midway', 4),\n",
       " ('Slim Straight 5pkt 1', 4),\n",
       " ('Slim Straight 5pkt', 4),\n",
       " ('Slim Selvedge', 4),\n",
       " ('Slim Midprice Zip Fly', 4),\n",
       " ('Slim Midprice Shorts', 4),\n",
       " ('Slim Midprice Button Fly', 4),\n",
       " ('Slim Freefit Shorts', 4),\n",
       " ('Slim 5pkt Zip Fly', 4),\n",
       " ('Slim 5pkt Midprice 1', 4),\n",
       " ('Slim 5pkt Lowprice', 4),\n",
       " ('Slim 5pkt 2', 4),\n",
       " ('Slim 5pkt 1', 4),\n",
       " ('Slim 5pkt', 4),\n",
       " ('Sleepbag Padded', 4),\n",
       " ('Skule sneaker', 4),\n",
       " ('Skinny Supreme Comfort', 4),\n",
       " ('Skinny Malcolm Zip Fly', 4),\n",
       " ('Skinny L.W Bargain (1)', 4),\n",
       " ('Skinny Bargain 1', 4),\n",
       " ('Skinny 5pkt Premiumprice', 4),\n",
       " ('Skinny 5pkt Midnight', 4),\n",
       " ('Skinny 5pkt Malcolm 3', 4),\n",
       " ('Skinny 5pkt Malcolm 2', 4),\n",
       " ('Skinny 5pkt Lowprice', 4),\n",
       " ('Sixten sweater', 4),\n",
       " ('Sixten fancy 3-p boxer BB', 4),\n",
       " ('Sixten TVP', 4),\n",
       " ('Sirpa twist', 4),\n",
       " ('Sirpa Basic TVP', 4),\n",
       " ('Simz anorak', 4),\n",
       " ('Simpson(1)', 4),\n",
       " ('Simple as that Cheeky Tanga', 4),\n",
       " ('Simple as That Triangle Top', 4),\n",
       " ...]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "prod_score_sorted"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "39c3af83-654c-418e-9843-e8d67888355e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('Sim mega hood', 8),\n",
       " ('Novelty Knits', 7),\n",
       " ('Novelty Knit', 7),\n",
       " ('Milano thin stripe shirt', 7),\n",
       " ('Lucky AOP CN', 7),\n",
       " ('John half zip mockneck', 7),\n",
       " ('Family 1 MAN Hood', 7),\n",
       " ('Cloude block stripe', 7),\n",
       " ('Christmas Mini Me sweater', 7),\n",
       " ('Christmas Fun', 7)]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "display(prod_score_sorted[:10])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "8bb1722f-b1b1-4482-b51f-9c481d2cb063",
   "metadata": {},
   "outputs": [],
   "source": [
    "def Recommendation(root):\n",
    "    x_label, x_value, node_neighbourbood =  pagerank_recommendation(root)\n",
    "    neighbour_product = all_common_product( node_neighbourbood,x_label)\n",
    "    prod_dict, prod_score = neighbour_attr_node_match(neighbour_product, node_neighbourbood, x_label, x_value)\n",
    "    prod_score_sorted = sorted( prod_score.items(), key=lambda kv:\n",
    "                 (kv[1], kv[0]),reverse=True)\n",
    "    return display(prod_score_sorted[:10])\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "a4e1f58e-1ca5-4e6a-9315-e5b0b288013d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "subcategory sweater\n",
      "Done \n",
      "\n",
      "section_name men project\n",
      "Done \n",
      "\n",
      "colour_group_name blue\n",
      "Done \n",
      "\n",
      "colour_group_name dark blue\n",
      "Done \n",
      "\n",
      "index_group_name menswear\n",
      "Done \n",
      "\n",
      "perceived_colour_value_name dark\n",
      "Done \n",
      "\n",
      "graphical_appearance_name stripe\n",
      "Done \n",
      "\n",
      "department_name projects\n",
      "Done \n",
      "\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[('Sim mega hood', 8),\n",
       " ('Novelty Knits', 7),\n",
       " ('Novelty Knit', 7),\n",
       " ('Milano thin stripe shirt', 7),\n",
       " ('Lucky AOP CN', 7),\n",
       " ('John half zip mockneck', 7),\n",
       " ('Family 1 MAN Hood', 7),\n",
       " ('Cloude block stripe', 7),\n",
       " ('Christmas Mini Me sweater', 7),\n",
       " ('Christmas Fun', 7)]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "ename": "NameError",
     "evalue": "name 'elapsed_time' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-32-679f84ff35e0>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m      4\u001b[0m \u001b[0;31m# get the end time\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m \u001b[0mst\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mtime\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtime\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 6\u001b[0;31m \u001b[0mprint\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m'Execution time:'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0melapsed_time\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'seconds'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m: name 'elapsed_time' is not defined"
     ]
    }
   ],
   "source": [
    "# get the start time\n",
    "et = time.time()\n",
    "Recommendation(root)\n",
    "# get the end time\n",
    "st = time.time()\n",
    "print('Execution time:', elapsed_time, 'seconds')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "e426b26f-6287-462e-b4ad-1dfe97522f2f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "139.0205476284027"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "st-et"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
